<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"d38dcd55b74c485ca901bc1477e2daf2f06d8c3f13a9419c2bcd59926d2656fc","plan_job_ref":"Job terraform plan #261 at https://github.com/suzutan/infra/actions/runs/22297953979","plan_out_hash":"1110912a4b9dda7df77ac91ed4d41579161359eeaa6493b9f471773f8f666a34","plan_hash":"f1a44af991c9e7abeb04f8f0d7e94c03b1c5c664787eecc7810d8d9e3ecdfc9e","plan_text_format":"diff","version":"2.2.3","closed":true} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudflare_zero_trust_access_application.livesync will be created
+   resource "cloudflare_zero_trust_access_application" "livesync" {
+       account_id                 = "********************************"
+       app_launcher_visible       = true
+       aud                        = (known after apply)
+       auto_redirect_to_identity  = false
+       destinations               = (known after apply)
+       domain                     = "livesync.harvestasya.org"
+       http_only_cookie_attribute = true
+       id                         = (known after apply)
+       name                       = "Obsidian LiveSync (CouchDB)"
+       policies                   = [
+           {
+               id         = (known after apply)
+               precedence = 1
            },
+           {
+               id         = "9aae1626-c4e4-4f86-bcce-96527713ac3e"
+               precedence = 2
            },
        ]
+       self_hosted_domains        = (known after apply)
+       session_duration           = "24h"
+       type                       = "self_hosted"
    }

  # cloudflare_zero_trust_access_policy.obsidian_livesync_service_token will be created
+   resource "cloudflare_zero_trust_access_policy" "obsidian_livesync_service_token" {
+       account_id       = "********************************"
+       decision         = "non_identity"
+       id               = (known after apply)
+       include          = [
+           {
+               service_token = {
+                   token_id = (known after apply)
                }
            },
        ]
+       name             = "Obsidian LiveSync Service Token"
+       session_duration = "24h"
    }

  # cloudflare_zero_trust_access_service_token.obsidian_livesync will be created
+   resource "cloudflare_zero_trust_access_service_token" "obsidian_livesync" {
+       account_id            = "********************************"
+       client_id             = (known after apply)
+       client_secret         = (sensitive value)
+       client_secret_version = 1
+       duration              = "8760h"
+       expires_at            = (known after apply)
+       id                    = (known after apply)
+       name                  = "Obsidian LiveSync - CouchDB"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   obsidian_livesync_cf_access_client_id     = (sensitive value)
+   obsidian_livesync_cf_access_client_secret = (sensitive value)
```
</details>

:white_check_mark: Plan applied in [terraform apply #167](https://github.com/suzutan/infra/actions/runs/22297987370)
<details><summary>Outputs</summary>

```hcl
archia_tunnel_id                          = "cd6f7222-15f6-40bc-a858-526e2890f20e"
archia_tunnel_token                       = (sensitive value)
github_actions_cf_access_client_id        = (sensitive value)
github_actions_cf_access_client_secret    = (sensitive value)
harvestasya_tunnel_token                  = (sensitive value)
obsidian_livesync_cf_access_client_id     = (sensitive value)
obsidian_livesync_cf_access_client_secret = (sensitive value)
oracle_tunnel_id                          = "411a294c-b51f-4b61-ba1f-fe7b916b37d8"
oracle_tunnel_token                       = (sensitive value)
vista_tunnel_id                           = "c410c2e1-484b-402c-bc86-05a01c922e46"
web_tunnel_id                             = "c1e6260a-e43b-4a32-a405-dbbd063cddb3"
web_tunnel_token                          = (sensitive value)
```
</details>